wmsmobile/src/Documents/итКонтрольнаяАгрегация/итКонтрольнаяАгрегация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итКонтрольнаяАгрегация</name>
  <posting>Deny</posting>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегированиеПоНаборке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеДокументаКСканированию</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтроковоеПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатурыСтроковоеПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатурыПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеСканированияДокумента</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатурыПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wmsmobile/src/InformationRegisters/ИтЗадачиНаТСД/ИтЗадачиНаТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИтЗадачиНаТСД</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучательПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.итНаборка</types>
      <types>DocumentRef.итОтгрузка</types>
      <types>DocumentRef.итПриемка</types>
      <types>DocumentRef.итЗадачиИнвентаризации</types>
      <types>DocumentRef.итПеремещение</types>
      <types>DocumentRef.итКонтрольнаяАгрегация</types>
      <types>DocumentRef.итРазмещение</types>
      <types>DocumentRef.итПроверка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

wmsmobile/src/InformationRegisters/итДанныеПомарочногоУчета/итДанныеПомарочногоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итДанныеПомарочногоУчета</name>
  <resources>
    <name>SSCC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>GTIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>СерияНоменклатуры</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРозлива</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НоменклатураПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияНоменклатурыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПризнакОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКлюч</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Марка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>190</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

wmsmobile/src/Documents/итКонтрольнаяАгрегация/Forms/ФормаСканированияКонтрольнойМарки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПомарочныйУчет") тогда
		ПомарочныйУчет=Параметры.ПомарочныйУчет;
		Если не Параметры.Свойство("Объект") Тогда 
			Отказ=Истина;
		КонецЕсли;
		Если не Параметры.Свойство("ИдентификаторУпаковки") Тогда 
			Отказ=Истина;
		КонецЕсли;

		Объект=Параметры.Объект;
		ИдентификаторУпаковки=Параметры.ИдентификаторУпаковки;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;	
		Если СтрДлина(Параметр)>=68 и КонтрольнаяМарка="" тогда
			КонтрольнаяМарка=Параметр;
			Если ПомарочныйУчет Тогда 
				Если не ПроверкаМаркиНаНаличиеВДанныхПомарочногоУчета() тогда
				КонтрольнаяМарка="";
				ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Марка не числится в данных помарочного учета");
				Возврат
				КонецЕсли;
			КонецЕсли;	
			Элементы.СканируйтеКонтрольнуюМарку_Интервал.Заголовок="Сканируйте интервал";
			Если  СтрДлина(Параметр)>68  Тогда 
				Интервал="000_000000000000";
			КонецЕсли;
		ИначеЕсли Сред(Параметр,4,1)="-" и Интервал=""   тогда
		    КоличествоСимволовОтклонения=33-СтрДлина(Параметр);
			СтрокаКОтправке=Сред(Параметр,5,11-КоличествоСимволовОтклонения);
			Серия=Лев(СтрокаКОтправке,3);
			Номер=Прав(СтрокаКОтправке,СтрДлина(СтрокаКОтправке)-3);
			Интервал=Серия+"_"+Номер;
			Элементы.СканируйтеКонтрольнуюМарку_Интервал.Заголовок="Сканируйте марку";
			//ОповеститьОВыборе(СтрокаКОтправке);
		иначе
			Сообщить("не верный формат штрих кода");
		КонецЕсли;
		Если ЗначениеЗаполнено(КонтрольнаяМарка) и ЗначениеЗаполнено(Интервал) тогда	
			ОповеститьОВыборе(новый Структура("КонтрольнаяМарка,Интервал",КонтрольнаяМарка,Интервал));
        КонецЕсли;
	КонецЕсли;
	КонецПроцедуры

&НаСервере
Функция ПроверкаМаркиНаНаличиеВДанныхПомарочногоУчета()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИтЗадачиНаТСД.ИдЗадачи
		|ПОМЕСТИТЬ ЗадачиДокумента
		|ИЗ
		|	РегистрСведений.ИтЗадачиНаТСД КАК ИтЗадачиНаТСД
		|ГДЕ
		|	ИтЗадачиНаТСД.ДокументОснование = &ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итДанныеПомарочногоУчета.Марка,
		|	итДанныеПомарочногоУчета.SSCC,
		|	итДанныеПомарочногоУчета.GTIN
		|ПОМЕСТИТЬ ДанныеМарокДокумента
		|ИЗ
		|	ЗадачиДокумента КАК ЗадачиДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итДанныеПомарочногоУчета КАК итДанныеПомарочногоУчета
		|		ПО ЗадачиДокумента.ИдЗадачи = итДанныеПомарочногоУчета.Ключ
		|СГРУППИРОВАТЬ ПО
		|	итДанныеПомарочногоУчета.Марка,
		|	итДанныеПомарочногоУчета.SSCC,
		|	итДанныеПомарочногоУчета.GTIN
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеМарокДокумента.Марка,
		|	ДанныеМарокДокумента.SSCC,
		|	ДанныеМарокДокумента.GTIN,
		|	ВЫБОР
		|		КОГДА ДанныеМарокДокумента.SSCC = &SSCC
		|			Тогда Ложь
		|		ИНАЧЕ Истина
		|	КОНЕЦ КАК НеТотSSCC
		|ИЗ
		|	ДанныеМарокДокумента КАК ДанныеМарокДокумента
		|ГДЕ
		|	ДанныеМарокДокумента.Марка = &Марка";
	
	Запрос.УстановитьПараметр("Марка", КонтрольнаяМарка);
	Запрос.УстановитьПараметр("ДокументОснование", Объект);
	Запрос.УстановитьПараметр("SSCC", ИдентификаторУпаковки);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() тогда
		Возврат Ложь;
	иначе
		Выборка=РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() тогда
			Если  Выборка.НеТотSSCC тогда
				Сообщить("Марка в данных есть, но принадлежит паллету № "+Выборка.SSCC);
				Возврат Ложь
			иначе
				Возврат Истина;
			КонецЕсли;
		иначе
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
		
КонецФункции
